Tekla Open API Reference for Tekla Structures 2025
Distance.ToDecimalString Method (String, IFormatProvider)
 Converts the distance to a decimal string representation.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToDecimalString(
	string format,
	IFormatProvider formatProvider
)
Public Function ToDecimalString (
	format As String,
	formatProvider As IFormatProvider
) As String
Parameters
format
Type: System.String
The format string.
formatProvider
Type: System.IFormatProvider
The number format provider.
Return Value
Type: String
The string representation of the distance.
Examples
 This example shows how to specify a number format and a format provider when converting a Distance instance into a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           string formattedString = distance.ToDecimalString("0.00", CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
ToDecimalString Overload
Tekla.Structures.Datatype Namespace